Autodesk.Revit.DB.FabricationPart.SetPartCustomDataText(System.Int32,System.String)
Set the custom data real value for the specified custom data.
customId:
The identifier of the custom data field to set.
value:
The text value of the custom data. If the data is not a text type the value will be parsed according to the fabrication confifuration rules.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2017 Subscription Update

Autodesk.Revit.DB.FabricationPart.GetPartCustomDataReal(System.Int32)
Get custom data real value for the specified custom data.
customId:
The identifier of the custom data field to get.
Returns:
Returns the real number of the custom data. If the data is not a number it will return 0.0.
Since:
2017 Subscription Update

Autodesk.Revit.DB.FabricationPart.GetPartCustomDataInteger(System.Int32)
Get custom data integer value for the specified custom data.
customId:
The identifier of the custom data field to get.
Returns:
Returns the integer of the custom data. If the data is not a number it will return 0.
Since:
2017 Subscription Update

Autodesk.Revit.DB.FabricationPart.GetPartCustomDataText(System.Int32)
Get custom data text for the specified custom data.
customId:
The identifier of the custom data field to get.
Returns:
Returns the text of the custom data. If the data is a number it will be formatted according to the fabrication configuration's rules.
Since:
2017 Subscription Update

Autodesk.Revit.DB.FabricationPart.HasCustomData(System.Int32)
Check if fabrication part contains custom data already.
customId:
The identifier of the custom data field to look for.
Returns:
returns true if the fabrication part contains the custom data.
Since:
2017 Subscription Update

Autodesk.Revit.DB.FabricationPart.IsStraightSegment(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId)
Validates if the part is a straight.
document:
The document.
partId:
Id of the straight to split.
Returns:
Returns true if the part is a straight false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2017 Subscription Update

Autodesk.Revit.DB.FabricationPart.HangerRodKit
Specifies whether an ancillary kit is being used to override support rods, bolts and clips, if any. A value of 0 indicates no override is being used.
Since:
2017 Subscription Update

Autodesk.Revit.DB.FabricationPart.ServiceId
The fabrication part service identifier. The service can only be changed to compatible services.
Since:
2016 Subscription Release